Revit 2024 API
ParameterTypeId.SteelElemWeldMainPrepdepth Property
 "Main Preparation Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SteelElemWeldMainPrepdepth { get; }
Visual Basic
Public Shared ReadOnly Property SteelElemWeldMainPrepdepth As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SteelElemWeldMainPrepdepth {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace